$(function(){
	/*²é¿´ÏêÇé*/
	/*(function(){		
		var _more = $(".more[t=openMore]");
		_more.each(function(){
			if(parseInt($(this).prev().outerHeight(true)) > 140){
				$(this).prev().height(130).show();
				$(this).show();
			}else{
				$(this).prev().height(parseInt($(this).prev().outerHeight(true)) - 30).css("margin","0 auto").show();
			}
		});	
		_more.on("mousedown",function(){
			$(this).prev().height("auto").css("margin","0 auto").end().hide();
		});
	})();*/
	

	/*¹¤¾ß¼¯º¯Êý*/
	var tool = {
		getData: function (url, callback) {
			var me = this;
			$.ajax({
				url: url,
				type: 'GET',
				dataType: 'jsonp',
				success: function (data) {
					if (data && data.code == 0) {
						callback(data);
					} else {
						alert(data.msg || 'error~~~');
					}
				},
				error: function (data) {
					alert('error~~~');
				}
			});
		},
		render: function (data, source, $node, noCover) {
			if (!data) return;
			var html;
			html = template.compile(source);
			
			if (noCover === undefined) {
				noCover = true;
			}

			$node[noCover ? 'append' : 'html'](html({
				list: data
			}));
		},
		twoDigit: function (v) {
			return parseInt(v, 10) < 10 ? '0' + v : v;
		}
	}

	/*ÏîÄ¿ key-value*/
	var dataDiscipline = {
		AR:'Éä¼ý',
		AT:'Ìï¾¶',
		BD:'ÓðÃ«Çò',
		BK:'ÀºÇò',
		BX:'È­»÷',
		CS:'Æ¤»®Í§¼¤Á÷»ØÐý',
		CF:'Æ¤»®Í§¾²Ë®',
		CB:'BMXÐ¡ÂÖ³µ',
		CM:'É½µØ×ÔÐÐ³µ',
		CR:'¹«Â·×ÔÐÐ³µ',
		CT:'³¡µØ×ÔÐÐ³µ',
		EQ:'ÂíÊõ',
		FE:'»÷½£',
		FB:'×ãÇò',
		GO:'¸ß¶û·ò',
		GA:'Ìå²Ù',
		GR:'ÒÕÊõÌå²Ù',
		GT:'±Ä´²',
		HB:'ÊÖÇò',
		HO:'Çú¹÷Çò',
		JU:'ÈáµÀ',
		MP:'ÏÖ´úÎåÏî',
		RO:'ÈüÍ§',
		RU:'7ÈËÖÆéÏé­Çò',
		SA:'·«´¬',
		SH:'Éä»÷',
		SW:'ÓÎÓ¾',
		SY:'»¨ÑùÓÎÓ¾',
		DV:'ÌøË®',
		WP:'Ë®Çò',
		TT:'Æ¹ÅÒÇò',
		TK:'õÌÈ­µÀ',
		TE:'ÍøÇò',
		TR:'ÌúÈËÈýÏî',
		VO:'ÅÅÇò',
		BV:'É³Ì²ÅÅÇò',
		WL:'¾ÙÖØ',
		WR:'Ë¤õÓ',
		OW:'ÂíÀ­ËÉÓÎÓ¾'
	};

	//domain
	var preDomain = '//ziliaoku.sports.qq.com';

	/*ÔË¶¯Ô±ÏêÇé*/
	var athData = {
		init: function () {
			var id, url, param, url2;

			id = getQueryString('athlete_id');
			url = preDomain + '/cube/index?cubeId=21&dimId=64&order=t2&from=sportsdatabase&params=';
			url2 = preDomain + '/cube/index?cubeId=40&dimId=92&needArr=1&from=sportsdatabase&params=';

			param = id ? ('t1:' + id) : '';
			url += param;
			url2 += param; //Èü³Ì½Ó¿Ú

			tool.getData(url, this.handle);
			tool.getData(url2, this.handleMatch);

			this.bindEvent();
		},
		handle: function (data) {
			if (!data || !data.data.olyPlayerInfo) return;

			var time;

			data = data.data.olyPlayerInfo;

			//nation
			data.nation = Nation.data[data.organisation] && Nation.data[data.organisation].cnName;

			//birthDate
			time = data.birthDate.split('-');
			data.birthDate = [time[0], 'Äê', time[1], 'ÔÂ', time[2], 'ÈÕ'].join('');

			//discipline
			data.discipline = dataDiscipline[data.disciplineId];
			athData.render(data);

			//news & video & athlete referred
			card.init();
			hotAthlete.init(data.disciplineId, $("#J_athlete"), 'YDY_xg');
		},
		render: function (data) {
			var src;

			src = ['<div class="pic"><img src="{{if list.logoBig}}{{list.logoBig}}{{else}}http://mat1.gtimg.com/2016stats/images/ydyD.jpg{{/if}}" alt="{{list.cnName}}" width="340px" height="193px"></div>',
						'<div class="text">',
							'<h3>{{list.cnName}}</h3>',
							'<p>¹ú¼®£º<a class="xm-dis" target="_blank" href="/country/match.htm?state={{list.organisation}}">{{list.nation}}</a><br />ÉúÈÕ£º{{list.birthDate}}<br />Éí¸ß£º{{if list.height != 0}}{{list.height}}cm{{else}}-{{/if}}<br />ÌåÖØ£º{{if list.weight != 0}}{{list.weight}}¹«½ï{{else}}-{{/if}}<br />ÏîÄ¿£º<a class="xm-dis" target="_blank" href="/item/data.htm?item_id={{list.disciplineId}}">{{list.discipline}}</a></p>',
						'</div>'].join('');

			//render detail
			tool.render(data, src, $("#J_detail"), false);

			//description
			$("#J_desc").html(data.description || 'ÔÝÎÞÊý¾Ý');
			//title
			$("#J_title").html(data.cnName || 'ÔË¶¯Ô±');
			athData.cnName = $.trim(data.cnName);
			//records
			$("#J_record").html(data.records || 'ÔÝÎÞÊý¾Ý');
		},
		handleMatch: function (data) {
			if (!data || !data.data.olyPartyUnits) {
				$("#J_match").html('<tr><td>ÔÝÎÞÈü³ÌÊý¾Ý</td>');
				return;
			}

			var data, time, item, day, hour;
			data = data.data.olyPartyUnits;

			for (var i = 0, len = data.length; i < len; i++) {
				item = data[i];
				time = item.startTime;
				day = parseInt(time.split(' ')[0].split('-')[2], 10);
				hour = time.split(' ')[1].slice(0, 5);
				item.time = [day, 'ÈÕ ', hour].join('');
				item.day = day;
				item.hour = parseInt(hour.slice(0, 2), 10);
				item.minute = parseInt(hour.slice(3), 10);

				//disciplineCnName - ÏîÄ¿
				if (!item.disciplineCnName) {
					item.disciplineCnName = dataDiscipline[item.disciplineId];
				}

				//eventName - Ð¡Ïî
				if (!item.eventName) {
					item.eventName = '-';
				}
			}
			
			//sort Èü³ÌÊý¾ÝÅÅÐò
			data.sort(function (a, b) {
				var dd = a.day - b.day,
					hd = a.hour - b.hour,
					md = a.minute - b.minute;

				if (dd > 0 || (dd == 0 && hd > 0) || (dd == 0 && hd == 0 && md > 0)) {
					return 1;
				} else if (dd < 0 || (dd == 0 && hd < 0) || (dd == 0 && hd == 0 && md < 0)) {
					return -1;
				} else {
					return 1;
				}
			});

			athData.renderMatch(data);
		},
		renderMatch: function (data) {
			var src, $node;

			$node = $("#J_match");
			src = ['{{each list as item}}',
					'<tr><td class="w1">{{item.time}}</td>',
						'<td class="w2">{{item.disciplineCnName}}</td>',
						'<td class="w3">{{item.eventName}}</td>',
						'<td class="w4">{{item.matchName}}</td></tr>', '{{/each}}'].join('');

			tool.render(data, src, $node, false);
		},
		bindEvent: function () {
			/*¶¯Ì¬ÊÓÆµÇÐ»»*/
			(function(){		
				var _tabBtn = $(".tabMod .hd h2 strong"),
					_tabDT = $(".tabDT"),
					_tabSP = $(".tabSP");
					
				_tabBtn.on("mousedown",function(){
					var $this = $(this), type;

					if(!$this.hasClass("now")){
						_tabBtn.removeClass("now");		
						$this.addClass("now");
						_tabDT.is(":visible") ? _tabDT.hide() : _tabDT.show();
						_tabSP.is(":visible") ? _tabSP.hide() : _tabSP.show();

						type = $this.data('type');
						Boss.cardQ(type);
					}
				});
			})();
		}
	}

	/*ÊÓÆµ & ¶¯Ì¬Ò³¿¨*/
	var card = {
		init: function () {
			this.newsMod();
			// this.videoMod();
		},
		videoData: {
			'Ò×Ë¼Áá':'1485056',
			'ÍõÃ÷¾ê':'220278',
			'Ò×½¨Áª':'124930',
			'ÖÜçù':'136062',
			'¹ù°¬Â×':'1502798',
			'ÂíÁú':'116695',
			'ÕÅ¼Ì¿Æ':'104297',
			'¶¡Äþ':'71016',
			'ÎâÃôÏ¼':'101185',
			'ºÎ×Ë':'151501',
			'Îâ¾²îÚ':'222069',
			'ÁÖµ¤':'107697',
			'ËÕ±þÌí':'1499326',
			'»ªÌì':'1502799',
			'¶ÅÀö':'293036',
			'·ëÉºÉº':'99543',
			'Çñ²¨':'484149',
			'ÅíË§':'104590',
			'ÂÀÐ¡¾ü':'1485803',
			'ÁÎ»Ô':'1485696',
			'ÐìÀò¼Ñ':'104931',
			'ÚÈÁú':'1502800',
			'ÀîÑ©ÜÇ':'1485805',
			'ÕÅÅàÃÈ':'1502801',
			'ÀîÏþÏ¼':'223095',
			'ÄþÔóÌÎ':'1342749',
			'ËïÑî':'102489',
			'Ò¶Ê«ÎÄ':'1485801',
			'³ÂÈôÁÕ':'115911',
			'ÁõÊ«ö©':'1502802',
			'ÂíÏþÐñ':'155821',
			'ÀîÂ¶':'139835',
			'Êæ½¨Ã÷':'1506744',
			'Ì·ÑÇ':'1506748',
			'ÖÜÓñ':'225818',
			'ÈÎÎÄ¾ý':'1506755',
			'Áõº£Æ¼':'1506758',
			'ÂíÇà':'1506763',
			'ÀîÔÃ':'1506768',
			'ÀîÇ¿':'1506771',
			'ÍõÈÕì¿':'1506774',
			'ÁõÞ¥è¦':'1506776',
			'Ë¾ÑÅ½Ü':'1506778',
			'Ê©Í¢í®':'1506781',
			'ÈÎÜç':'1506783',
			'³Â°¬É­':'1506784',
			'ºÎ³¬':'1506786',
			'ßÃÀþ':'1506788',
			'»ÆÑ©³½':'1506789',
			'ËïÎÄÑã':'1506791',
			'ÁºÜ°èÒ':'1506792',
			'¹ËÐ¦':'1326872',
			'ÌÀÃÎÄÝ':'1506797',
			'Òü³Éê¿':'1506800',
			'ÔøÕä':'219178',
			'ÀîÏþè´':'1506805',
			'Íõåû':'149010',
			'ÉÌ´ºËÉ':'1506825',
			'Ã«ÒÕ':'1506832',
			'Ì·¼ÑÐ½':'1506835',
			'·¶ÒäÁÕ':'1506838',
			'ÁÖ³¬ÅÊ':'1506839',
			'ÕÅ³ÉÁú':'1506841',
			'ÓÈºÆ':'1506843',
			'µËÊéµÜ':'1506844',
			'ÁõÑó':'1506846',
			'Àîµ¤':'1506849',
			'ÖìÓêÁá':'1506855',
			'Ðíê¿':'1506860',
			'·®Õñ¶«':'1506867',
			'ÁÖÏ£æ¥':'1506874',
			'Àîê»Í©':'1506877',
			'Îâ°¢Ë³':'1506878',
			'³ÂÅåÄÈ':'1506746',
			'¹¬ÀÚ':'1506751',
			'»ÆÀöÖé':'1506749',
			'Íõ°®³À':'1506750',
			'Íõçâ':'1506753',
			'ÍõÏþÀö':'136852',
			'Ðìê°¾ü':'1506754',
			'ÚÈÀû¾ü':'1506887',
			'µËÞ±':'94500',
			'ºîÖ¾»Û':'1506883',
			'ÀèÑÅ¾ý':'1506882',
			'ÁúÇåÈª':'1506884',
			'Ê¯ÖÇÓÂ':'110705',
			'ÌïÌÎ':'1506886',
			'ÏòÑÞÃ·':'1506881',
			'ÑîÕÜ':'1506889',
			'ÍõÇ¾':'1506764',
			'ÐìÒ»á¦':'1506770',
			'ÕÅË§':'1506762',
			'Ö£ÈüÈü':'1506767',
			'°¬ÑÜº¬':'1506827',
			'²Ü«h':'1506808',
			'³Â½à':'1506739',
			'³ÂÐÀâù':'339904',
			'¶­½à':'1506806',
			'¸µÔ°»Û':'1506793',
			'ºÎ½¡±ò':'1506851',
			'ºîÑÅö©':'1506830',
			'ºúÒÝÐù':'1506871',
			'Àî¹ãÔ´':'1506865',
			'ÀîÏì':'1506859',
			'ÀîÖìå©':'1506864',
			'ÁÖÓÀÇì':'1506857',
			'ÁõÏæ':'1506814',
			'ÁõÕ×³¾':'1506873',
			'ÁøÑÅÐÀ':'1506829',
			'Â½äÞ':'165072',
			'Ã«·ÉÁ®':'1506856',
			'Çñ×Ó°Á':'1506866',
			'ÉÌ¿ÆÔª':'1506861',
			'Éòîì':'1506807',
			'Ê·æºÁÕ':'1506801',
			'ËïÃÀ³¿':'1506811',
			'ÌÆÞÈ':'1506799',
			'ÌÆÓêæÃ':'1506834',
			'ÍôË³':'1506852',
			'ÍôÑ©¶ù':'1506826',
			'ÍõÊ©¼Ñ':'1506802',
			'ÎâÓîº½':'1506870',
			'ÐÁöÎ':'1506803',
			'Ðì¼ÎÓà':'1506853',
			'ãÆ×Ó±´':'1506869',
			'ÓÚ¾²Ñþ':'1506831',
			'ÓàºØÐÂ':'1506863',
			'ÕÅ÷è±ó':'1506854',
			'ÕÅÜ°Óè':'1506821',
			'ÕÅÓêö­':'1506823',
			'ÕÅÓêº­':'1506824',
			'ÖÜÃô':'1506813',
			'ÖÜôàÁØ':'1506810',
			'ÖìÃÎ»Ý':'1506820',
			'×æÁ¢¾ü':'1506850',
			'Ñî¬B':'1506804',
			'ÓÚÑó':'1486622',
			'Óà³É¸Õ':'1506779',
			'ÕÅ éª':'1491186',
			'ÕÅ|':'1506818',
			'ÕÅæº':'1506840',
			'ÕÅÁé':'1506775',
			'ÕÅÁá':'1506848',
			'ÕÅÃô':'1506741',
			'ÕÅÞ±Þ±':'1506819',
			'ÕÅÜ°ÔÂ':'1506772',
			'ÕÔ¾°±õ':'1506790',
			'ÕÔ¾´éª':'1506845',
			'ÕÔÜ¿ÀÙ':'1506872',
			'ÕÔ×Óº­':'1506833',
			'ÖìÎ¤Î°':'1506752',
			'±«ÓïÇç':'1506858',
			'ÔøÌÎ':'1506798',
			'²ñì®':'1506888',
			'¶Î¾²Àò':'1506747',
			'¸µº£·å':'99346',
			'ºéì¿':'1506890',
			'»ÆÎÄÒÇ':'1506759',
			'½­Ñà':'1506743',
			'ÂæÓ®':'1506876',
			'ÂæÓð':'1506879',
			'ÂÀÑï':'1506769',
			'Âí»¶»¶':'1506815',
			'Âí½ú':'1506875',
			'Ã·Ð¦º®':'1506836',
			'ÃçÌð':'1506761',
			'Å£¹ÚÄÐ':'1506842',
			'ÅË·Éºè':'1506757',
			'ÅíÁÖ':'1506822',
			'ÉÐÈØ':'1506847',
			'ÊæË¼Ñþ':'1506868',
			'ËÎ¶¬Â×':'1506812',
			'ËïÑÅæÃ':'1506809',
			'ÌÆÔ¨œs':'1506885',
			'Íõ½Ü':'1506777',
			'ÍõÌúöÎ':'1506780',
			'Íõì§ÑÞ':'1506828',
			'ÍõÒÇº­':'1506880',
			'ÍõÓîÎ¢':'1506773',
			'ÐÜ¶Øå«':'1506837',
			'Ðì³¿':'1506891',
			'ÕÅÎÄÐã':'1506893',
			'ÁõæÃæÃ':'99855',
			'¹®Á¢æ¯':'1506897',
			'Íõá¿':'109642',
			'ÀîÁáÎµ':'1506902',
			'ÂÀÐãÖ¥':'1506905',
			'Î¤ÓÀÀö':'1506908',
			'Íõ´ºÓê':'140588',
			'ÀîÁá':'1506915',
			'ÇÐÑôÊ²½ã':'1506917',
			'ÂÀ»á»á':'1506921',
			'Ô¬çùçù':'1506922',
			'ÁÖ»Û¾ý':'132711',
			'ÈÎÃÎÜç':'1506927',
			'ÎâË®½¿':'1506930',
			'ÔÀ³¬':'1506933',
			'ÁõÊ«Ó±':'1506938',
			'¸ßÑô':'1506940',
			'ÀîÐ¡ºì':'1506941',
			'¿×ÁîÎ¢':'1506944',
			'±å¿¨':'1506945',
			'ËÕÐÀÔÃ':'1506947',
			'³ÂÑï':	'1506949',
			'·ë±ò':'1506951',
			'ÁºÐ¡¾²':'1506953',
			'¸ðÂüÆå':'1506955',
			'ÕÅÐÂÑÞ':'1506957',
			'»ªÉÜÇà':'1506959',
			'Áõºç':'83817',
			'Ñî¼ÒÓñ':'1506960',
			'²ÌÔóÁÖ':'1507037',
			'ÕÅ¹úÎ°':'1507038',
			'Ð»ÎÄ¿¥':'1507039',
			'¶­±ó':'513129',
			'ÍõÕò':'1507041',
			'³Â¶¨':'1485806',
			'¶­¹ú½¨':'1507043',
			'ÍõÓî':'1507045',
			'²ÜË¶':'302710',
			'Ð»ÕðÒµ':'464658',
			'Ñ¦³¤Èñ':'1507046',
			'ÄªÓÐÑ©':'1507047',
			'ÍõÕñ¶«':'1507048',
			'Íõ¼ÎÄÐ':'1507050',
			'»Æ³£ÖÞ':'1507051',
			'ÑîÑó':'1507052',
			'¸ßÐËÁú':'1507053',
			'¶à²¼½Ü':'1507054',
			'ÌÀÐÇÇ¿':'1507055',
			'»Æ²©¿­':'1507056',
			'Ò¦½Ý':'102131',
			'ÐìÏþÁú':'1507058',
			'º«Óñ³É':'1507060',
			'ÓÚÎ°':'1507061',
			'ÖìÈÊÑ§':'1507062',
			'ÌÆ¹¦³¼':'1507063',
			'Íõ¿­»ª':'1507064',
			'ÕÅº½':'1507066',
			'¹¬½ð½Ü':'1507067',
			'ÂÞÏþÁá':'1507068',
			'»Æ¶¬ÑÞ':'1507069',
			'¾´ÑÇÀò':'1507070',
			'ÕÔ±¦·¼':'1507071',
			'ÖÓÌìÊ¹':'1507072',
			'ÂíÃÎÂ¶':'1507073',
			'Ò¦Æ½':'1507075',
			'ÁÖ¿¡ºì':'1507076',
			'Íõºì':'1507077',
			'Íõìõ':'1507029',
			'ÁõºÆ':'1507030',
			'Ðì³¬':'1507031',
			'ÇØ³¿Â·':'1507032',
			'·¶Ñô':'1507033',
			'ÉòÆ½°²':'1507034',
			'Ñ¦³¬»ª':'1507035',
			'ËïÓñ½à':'1507014',
			'Ðí°²ç÷':'1485908',
			'ÀÖ»ÛÁÖ':'1507015',
			'ÁõÓ½Ê«':'1507016',
			'ËïÒ»ÎÄ':'1507018',
			'Éò³¿':'1507019',
			'ºÂ¼ÑÂ¶':'1507020',
			'Âí½£·É':'1506997',
			'³Âº£Íþ':'1506998',
			'ËïÎ°':'1507000',
			'½¹ÔÆÁú':'1507001',
			'Ê©¼ÎÂå':'1507002',
			'ÕÅÔ½':  '104413',
			'Îâº£Ñà':'96261',
			'ÁõÉ¼É¼':'1506894',
			'ÕÔÈÝ':'1506895',
			'¹ÅÑÅÉ³':'1506896',
			'ÑîÀö':'188391',
			'ÍõÉºÉº':'190208',
			'Àî¶¬ÄÈ':'1506898',
			'ÕÅî£':'1506900',
			'ÀîÓ°':'134598',
			'¸ß³¿':'1506904',
			'ÅÓ·áÔÂ':'1506907',
			'ÑîÂü':'976302',
			'ÂíÏþÐñ':'155821',
			'ÍõËª':'1506910',
			'Ñ¦‹É':'1506919',
			'ÕÔÀöÄÈ':'223756',
			'Ì·ÈãÒó':'1506923',
			'Â¦¼Ñ»Ý':'1506925',
			'º«Åô':'1506928',
			'ÍõìÍ':'1506929',
			'±ÏÏþÁÕ':'1506931',
			'´ÞÇïÏ¼':'1506934',
			'ËÎÇåÁä':'1506936',
			'Àî¶¬Ïþ':'1506939',
			'ÍõÃÎÓê':'1506943',
			'ÅíÑî':'1506946',
			'µÂ½¿½¿':'1506950',
			'ÕÔÓñµñ':'1506954',
			'ÁºÃÀÓñ':'1291684',
			'ÀîºìÏÀ':'1506962',
			'ÕÅóïÑ©':'1506966',
			'ÍõÄÈ':'109541',
			'Àî¼Ñçù':'1506968',
			'ËïÏþ':'1506971',
			'ÓÚÙ»':'1506972',
			'ÕÅ½ðÈÙ':'1506974',
			'ÎâÇí':'1506975',
			'¹ú¼Ñ¼Ñ':'1506977',
			'Å·×ÏÏ¼':'1506979',
			'ÓÚËÌ':'1506980',
			'ÕÅÕã»Û':'1506981',
			'ÂíÓ¢éª':'1506983',
			'Ñî¿¡Ï¼':'1506985',
			'Âí¶Ë±ó':'1506987',
			'ÕÅ¾¸æº':'1506990',
			'¹ùÎÄ¬B':'1506992',
			'³ÂÓ±':'1506993',
			'ÎºÄþ':'116931',
			'³Â·¼':'115901',
			'ÎºÃÈ':'493623',
			'ÕÅ±ò±ò':'1507003',
			'ÕÅÃÎÑ©':'1507005',
			'ÖìÆôÄÏ':'1486861',
			'ºú±óÔ¨':'1507007',
			'ÀîÔ½ºê':'1507008',
			'ÍõÖÇÎ°':'1507010',
			'ÆÑç÷·å':'1507011',
			'ÅÓÎ°':'1507012',
			'ÑîºÆÈ»':'1496163',
			'ÅËÇ¿':'1507013',
			'ÕÅ¸»Éý':'1507017',
			'ÕÔÉù²¨':'1507021',
			'²ÜÒÝ·É':'1507022',
			'»Ý×Ó³Ì':'1507023',
			'²Ü»Û':'1507024',
			'ÆëÓñºì':'1507025',
			'Îâ¼ÑÐÀ':'1507026',
			'ÐÏÓî':'1507027',
			'¹ËÑ©ËÎ':'1507028',
			'Íõ´óÅô':'376019',
			'ÀîÙ»':'1507036',
			'ÈÎ²Ó²Ó':'1507040',
			'Òü¾ü»¨':'1507044',
			'ÕÔÃ÷¸Õ':'1507049',
			'É½¿¡':'1507057',
			'ÂÀ±ó':'100960',
			'ºúÇ«Ñ·':'1507059',
			'ÕÅ¼Òçâ':'1507065',
			'ÁõÎ°':'1507074',
			'ºú½¨¹Ø':'1507078',
			'ÓÚ·áîø':'1507079'
		},
		newsMod: function () {
			var keyword = athData.cnName;
			tagFall.init(keyword, 'YDY_xw');
		},
		videoMod: function () {
			// ¾«Ñ¡ÊÓÆµ
			new Videos('J_hotvideo', this.getVideoUrl('hot'), 'YDY_jx', false, 10);
			// ÔË¶¯Ô±ÊÓÆµÒ³¿¨
			new Videos('J_videos', this.getVideoUrl('athlete'), 'YDY_spy', true, 20);
		},
		getVideoUrl: function (type) {
			var cnName = athData.cnName;
			var base = '//sportlist.video.qq.com/fcgi-bin/list_common_cgi?otype=json&platform=1&version=10000&intfname=web_sports_common_vid_list&tid=502&uappid=20001162&uappkey=9da00e02b727f1cd&type=4&&sourcetype=2&c_category=11184,11185,11186&sort=3&novalue=1';

			if (type == 'hot') {
				return '//i.match.qq.com/pac/olympicvideo?';
			} else if (type = 'athlete') {
				return [base, '&1065=', this.videoData[cnName] || ''].join('');
			} else if (type = 'discipline') {//ÏîÄ¿
				return [base, '&742=', this.videoData[cnName] || ''].join('');
			}
		}
	}

	/*Í³¼Æ*/
	var Boss = {
		init: function () {
			ExposureBoss(null, 'YDY_xq');
		},
		cardQ: function (type) {
			registerZone2({
				bossZone: type
			}, 'click');
		}
	}

	//nation -> athData -> card
	Nation.get(function () {
		athData.init();
		Boss.init();
	});
});/*  |xGv00|9acdc90406a1c3130818255968b57bfd */